Revit 2027 API
ModelPathUtils.GetAllCloudRegions Method
 Gets all available regions that are supported by the cloud service. It returns an empty list when something gets wrong. Check the journal to see the error message for further information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<string> GetAllCloudRegions()
Public Shared Function GetAllCloudRegions As IList(Of String)
public:
static IList<String^>^ GetAllCloudRegions()
static member GetAllCloudRegions : unit -> IList<string>
Return Value
IList<String>
 The list of regions.
Remarks
 The list may change dynamically when Revit Cloud Model are declared to support more regions.
See Also
Reference
ModelPathUtils Class
Autodesk.Revit.DB Namespace